___

<a href='https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html'> <img src='https://www.python.org/static/img/python-logo.png' /></a>
___

# Groupby

El método **groupby** le permite agrupar filas de datos y llamar a funciones agregadas

In [1]:
import pandas as pd
# Creamos un dataframe
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Persona':['Luis','Juan','Oscar','Rosa','Jorge','Esteban'],
       'Ventas':[200,120,340,124,243,350]}

In [18]:
!pip install --upgrade pandas

Requirement already satisfied: pandas in c:\users\usuario\appdata\roaming\python\python311\site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [19]:
df = pd.DataFrame(data)

In [34]:
print(pd.__version__)

2.0.2

In [20]:
df

  Empresa  Persona  Ventas
0    GOOG     Luis     200
1    GOOG     Juan     120
2    MSFT    Oscar     340
3    MSFT     Rosa     124
4      FB    Jorge     243
5      FB  Esteban     350

**Ahora se puede usar el método .groupby () para agrupar filas basándose en el nombre de una columna. Por ejemplo, agrupemos en función de la empresa. Esto creará un objeto DataFrameGroupBy:**

In [21]:
df.groupby('Empresa')

Puedes guardar este objeto como una nueva variable:

In [35]:
by_emp = df.groupby('Empresa')

Y luego llamar a los métodos agregados fuera del objeto:

In [43]:
by_emp["Ventas"].mean()

Empresa
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Ventas, dtype: float64

In [45]:
df.groupby('Empresa')["Ventas"].mean()

Empresa
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Ventas, dtype: float64

Más ejemplos de métodos agregados:

In [46]:
by_emp["Ventas"].std()

Empresa
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Ventas, dtype: float64

In [47]:
by_emp.min()

         Persona  Ventas
Empresa
FB       Esteban     243
GOOG        Juan     120
MSFT       Oscar     124

In [38]:
by_emp.max()

        Persona  Ventas
Empresa
FB        Jorge     350
GOOG       Luis     200
MSFT       Rosa     340

In [39]:
by_emp.count()

         Persona  Ventas
Empresa
FB             2       2
GOOG           2       2
MSFT           2       2

In [40]:
by_emp.describe()

        Ventas
         count   mean         std    min     25%    50%     75%    max
Empresa
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [41]:
by_emp.describe().transpose()

Empresa               FB        GOOG        MSFT
Ventas count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000

In [42]:
by_emp.describe().transpose()['GOOG']

Ventas  count      2.000000
        mean     160.000000
        std       56.568542
        min      120.000000
        25%      140.000000
        50%      160.000000
        75%      180.000000
        max      200.000000
Name: GOOG, dtype: float64

# Buen trabajo!